#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.fourkeys.data.archive_file.events_bq_writer_source: Reading...
module.fourkeys.module.gcloud_build_batch_events_bq_writer.data.external.env_override[0]: Reading...
module.fourkeys.data.archive_file.events_bq_writer_source: Read complete after 0s [id=4148304a069dc150dd592a1a4d95e056979ef09b]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.data.external.env_override[0]: Read complete after 0s [id=-]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.null_resource.run_command[0]: Refreshing state... [id=8564185264401354472]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.null_resource.run_destroy_command[0]: Refreshing state... [id=7292871663324696080]
module.fourkeys.data.google_project.project: Reading...
module.fourkeys.google_storage_bucket.gh_audit_log_station_local: Refreshing state... [id=off-net-dev-gh-audit-log-station-local]
module.fourkeys.google_storage_bucket.events_archieve_local: Refreshing state... [id=off-net-dev-events-archieve-local]
module.fourkeys.google_storage_bucket.events_station_local: Refreshing state... [id=off-net-dev-events-station-local]
module.fourkeys.google_storage_bucket.gh_audit_log_archieve_local: Refreshing state... [id=off-net-dev-gh-audit-log-archieve-local]
module.fourkeys.google_bigquery_dataset.dataset: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys]
module.fourkeys.google_bigquery_table.batch_events: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys/tables/batch_events]
module.fourkeys.google_bigquery_table.batch_logs: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys/tables/batch_logs]
module.fourkeys.data.google_project.project: Read complete after 1s [id=projects/off-net-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.fourkeys.google_cloud_run_service.batch_events_bq_writer will be created
  + resource "google_cloud_run_service" "batch_events_bq_writer" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "northamerica-northeast1"
      + name                       = "batch_events_bq_writer"
      + project                    = "off-net-dev"
      + status                     = (known after apply)

      + metadata {
          + annotations           = {
              + "autoscaling.knative.dev/minScale" = "1"
              + "client.knative.dev/user-image"    = "gcr.io/off-net-dev/batch_events:4148304a069dc150dd592a1a4d95e056979ef09b"
              + "run.googleapis.com/ingress"       = "all"
            }
          + effective_annotations = {
              + "autoscaling.knative.dev/minScale" = "1"
              + "client.knative.dev/user-image"    = "gcr.io/off-net-dev/batch_events:4148304a069dc150dd592a1a4d95e056979ef09b"
              + "run.googleapis.com/ingress"       = "all"
            }
          + effective_labels      = (known after apply)
          + generation            = 0
          + namespace             = (known after apply)
          + resource_version      = (known after apply)
          + self_link             = (known after apply)
          + terraform_labels      = (known after apply)
          + uid                   = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = {
                  + "client.knative.dev/user-image"  = "gcr.io/off-net-dev/batch_events:4148304a069dc150dd592a1a4d95e056979ef09b"
                  + "run.googleapis.com/client-name" = "cloud-console"
                }
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = "dora-wif@off-net-dev.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "gcr.io/off-net-dev/batch_events:4148304a069dc150dd592a1a4d95e056979ef09b"
                  + name  = (known after apply)

                  + env {
                      + name  = "PROJECT_NAME"
                      + value = "off-net-dev"
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # module.fourkeys.google_cloud_run_service_iam_binding.event_handler_noauth will be created
  + resource "google_cloud_run_service_iam_binding" "event_handler_noauth" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "northamerica-northeast1"
      + members  = [
          + "allUsers",
        ]
      + project  = "off-net-dev"
      + role     = "roles/run.invoker"
      + service  = "batch_events_bq_writer"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @lendly-telus-com, Action: `pull_request`*